# Table of Contents
 <p><div class="lev1"><a href="#Import-pandas,-numpy,-matplotlib-and-seaborn"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas, numpy, matplotlib and seaborn</a></div><div class="lev1"><a href="#Create-a-Series-object,-access-it's-index-and-cells"><span class="toc-item-num">2&nbsp;&nbsp;</span>Create a Series object, access it's index and cells</a></div><div class="lev1"><a href="#Create-a-DataFrame-object,-access-its-rows,-columns,-indices,-cells"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create a DataFrame object, access its rows, columns, indices, cells</a></div><div class="lev1"><a href="#Data-Import"><span class="toc-item-num">4&nbsp;&nbsp;</span>Data Import</a></div><div class="lev1"><a href="#DataFrame-filtering"><span class="toc-item-num">5&nbsp;&nbsp;</span>DataFrame filtering</a></div><div class="lev1"><a href="#Data-export"><span class="toc-item-num">6&nbsp;&nbsp;</span>Data export</a></div><div class="lev1"><a href="#DataFrame-aggregation"><span class="toc-item-num">7&nbsp;&nbsp;</span>DataFrame aggregation</a></div><div class="lev1"><a href="#Data-Merging"><span class="toc-item-num">8&nbsp;&nbsp;</span>Data Merging</a></div>

This notebook is to quickly repeat the most basic pandas operations prior to starting the practical course.
You should be able to quickly perform the following tasks before you start working on the exercises in the Day1 notebook. If you need to look up, how certain problems can be solved, have a look at the pandas [10 Minutes Introduction](http://pandas.pydata.org/pandas-docs/stable/10min.html), the [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html) and the lecture slides.

# Import pandas, numpy, matplotlib and seaborn

In [1]:
import pandas as pandas
import numpy as numpy
import matplotlib as matlib
import seaborn as seaborn

# Create a Series object, access it's index and cells

Create a Series object representing the following measurements

| S   |
|-----|
| 1.0 |
| 1.5 |
| 3.0 |
| 4.3 |
| 8.2 |

In [2]:
# create array of measurements
number_array = [1,1.5,3,4.3,8.2]

# create Series object
my_series = pandas.Series([1,2.5,3,4,5])

print("Access by index %s:", (my_series.get(0)))
print(my_series)

Access by index %s: 1.0
0    1.0
1    2.5
2    3.0
3    4.0
4    5.0
dtype: float64

# Create a DataFrame object, access its rows, columns, indices, cells

Create a dataframe of the following table.

|index   |a |b  |c   |d          |e |
|--------|--|---|----|-----------|--|
|1       |2 |3  |5.  |horse      |13|
|2       |3 |1  |1.4 |cat        |11|
|3       |4 |9  |1.2 |dog        |  |
|4       |5 |12 |0.8 |tortoise   |  |
|5       |6 |2  |2.3 |rabbit     |9 |

Now
* access the values of each row individually
* access single cells
* print the index and column names
* access values of each column individually
* rename columns
* extract rows 2-4 as new dataframe
* obtain summary table of dataframe

In [3]:
# create dictionary of table entries
value_dict = {"index": [1,2,3,4,5], "a": [2,3,4,5,6], "b": [3,1,9,12,2], "c": [5.,1.4,1.2,0.8,2.3], "d": ['horse', 'cat', 'dog', 'tortoise', 'rabbit'], "e": [13,11,0,0,9]}

# construct data frame from dictionary
data_frame = pandas.DataFrame(value_dict)

# print dictionary
data_frame

   a   b    c         d   e  index
0  2   3  5.0     horse  13      1
1  3   1  1.4       cat  11      2
2  4   9  1.2       dog   0      3
3  5  12  0.8  tortoise   0      4
4  6   2  2.3    rabbit   9      5

# Data Import

Import the following file into a dataframe _df2_:

https://raw.githubusercontent.com/sebwink/Integrated_Bioinformatics/master/example_data/example_df.csv

In [4]:
# define url of the file
url = '/Users/mariowassmer/Desktop/PIBI/IntegratedBioinformatics/example_data/example_df.csv'

# read html
df2 = pandas.read_csv(url)

# replace NaN with empty string
df2.fillna('')

   a   b    c         d   e
0  2   3  5.0     horse  13
1  3   1  1.4       cat  11
2  4   9  1.2       dog
3  5  12  0.8  tortoise
4  6   2  2.3    rabbit   9

Now import the following file into a pandas dataframe _df3_. Do you need to change some parameters of the funtion?
Check whether import makes sense by showing the dataframe

https://raw.githubusercontent.com/sebwink/Integrated_Bioinformatics/master/example_data/example_df2.csv

In [5]:
# define url of the file
url = '/Users/mariowassmer/Desktop/PIBI/IntegratedBioinformatics/example_data/example_df2.csv'

# read html. This file uses ';' as separators. Therefore I have to set the parameter sep=';'
df3 = pandas.read_csv(url, sep=";")

# replace NaN with empty string
df3.fillna('')

   a   b    c         d   e
0  2   3  5.0     horse  13
1  3   1  1.4       cat  11
2  4   9  1.2       dog
3  5  12  0.8  tortoise
4  6   2  2.3    rabbit   9

# DataFrame filtering
Using the dataframe created in section 3:

* select rows containing values greater than 2 in the 3rd column
* select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
* drop rows with missing data
* drop duplicate rows
* drop 1st column from dataframe
* sort rows by 2nd column
* convert Strings in 4th column to title-case

In [18]:
# select rows with values greater than 2 in the third column
is_greater_2 = df2['d'] > 2
# print resuls
df2[is_greater_2]

TypeError: '>' not supported between instances of 'str' and 'int'

In [7]:
# contains 'cat' in the 4th column?
cat = df2['d'] == 'cat'
df2[is_greater_2 | cat]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [8]:
# drop rows with missing data
df2 = df2.dropna(axis=0, how='any')
df2

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [9]:
# drop duplicate rows
df2.drop_duplicates()

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [10]:
#drop 1st column of dataframe
df2.drop(df2.columns[0], axis=1)

   b    c       d     e
0  3  5.0   horse  13.0
1  1  1.4     cat  11.0
4  2  2.3  rabbit   9.0

In [11]:
#sort rows by 2nd column
df2.sort_values(by=df2.columns[1])

   a  b    c       d     e
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0
0  2  3  5.0   horse  13.0

In [12]:
# convert Strings in 4th column to title-case
df2['d'] = df2['d'].str.title()
df2

   a  b    c       d     e
0  2  3  5.0   Horse  13.0
1  3  1  1.4     Cat  11.0
4  6  2  2.3  Rabbit   9.0

# Data export

Export your filtered dataframe as a text file separated by tabs omitting the index column.

In [13]:
print (df2.to_csv(sep='\t', index=False, header=True))

a	b	c	d	e
2	3	5.0	Horse	13.0
3	1	1.4	Cat	11.0
6	2	2.3	Rabbit	9.0

# DataFrame aggregation

Using _df4_, group the data by column 'b'. Test different ways of aggregating the remaining columns as shown in the lecture.

In [14]:
df4 = df2.groupby('b').agg('min')
df4

   a    c       d     e
b
1  3  1.4     Cat  11.0
2  6  2.3  Rabbit   9.0
3  2  5.0   Horse  13.0

# Data Merging

* Merge df3 with df4 on columns c, d and e. Change columns with same names in a meaningful way.

In [15]:
print(df2)
print(df4)
print()
pandas.merge(df2, df4, on=['c', 'd', 'e'], how='inner')

   a  b    c       d     e
0  2  3  5.0   Horse  13.0
1  3  1  1.4     Cat  11.0
4  6  2  2.3  Rabbit   9.0
   a    c       d     e
b
1  3  1.4     Cat  11.0
2  6  2.3  Rabbit   9.0
3  2  5.0   Horse  13.0

   a_x  b    c       d     e  a_y
0    2  3  5.0   Horse  13.0    2
1    3  1  1.4     Cat  11.0    3
2    6  2  2.3  Rabbit   9.0    6

* Now perform a full outer join of the data, to keep all rows contained in either of the two dataframes.

In [17]:
pandas.merge(df2, df4, on=['c', 'd', 'e'], how='outer')

   a_x  b    c       d     e  a_y
0    2  3  5.0   Horse  13.0    2
1    3  1  1.4     Cat  11.0    3
2    6  2  2.3  Rabbit   9.0    6